zephyrproject-rtos/zephyr/ext/hal/nxp/mcux/devices/MKW41Z4/MKW41Z4.svd
        <register>
          <name>PKT_BUFFER_RX20</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1A8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX21</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1AA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX22</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1AC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX23</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1AE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX24</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1B0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX25</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1B2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX26</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1B4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX27</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1B6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX28</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1B8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX29</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1BA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX30</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1BC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX31</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1BE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX32</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1C0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX33</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1C2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX34</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1C4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX35</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1C6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX36</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1C8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX37</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1CA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX38</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1CC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX39</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1CE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX40</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1D0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX41</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1D2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX42</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1D4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX43</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1D6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX44</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1D8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX45</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1DA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX46</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1DC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX47</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1DE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX48</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1E0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX49</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1E2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX50</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1E4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX51</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1E6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX52</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1E8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX53</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1EA</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX54</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1EC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX55</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1EE</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX56</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1F0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PKT_BUFFER_RX57</name>
          <description>Packet Buffer RX</description>
          <addressOffset>0x1F2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>PKT_BUFFER_RX</name>
              <description>Packet Buffer Entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
